{
  "architectures": [
    "Blip2ForConditionalGeneration"
  ],
  "image_text_hidden_size": 256,
  "image_token_index": null,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "model_type": "blip-2",
  "num_query_tokens": 32,
  "qformer_config": {
    "attention_probs_dropout_prob": 0.1,
    "cross_attention_frequency": 2,
    "encoder_hidden_size": 1024,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "blip_2_qformer",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "position_embedding_type": "absolute",
    "use_qformer_text_input": false,
    "vocab_size": 30522
  },
  "text_config": {
    "_name_or_path": "facebook/opt-1.3b",
    "_remove_final_layer_norm": false,
    "activation_dropout": 0.0,
    "activation_function": "relu",
    "architectures": [
      "OPTForCausalLM"
    ],
    "attention_dropout": 0.0,
    "do_layer_norm_before": true,
    "dropout": 0.1,
    "enable_bias": true,
    "ffn_dim": 8192,
    "hidden_size": 2048,
    "init_std": 0.02,
    "layer_norm_elementwise_affine": true,
    "layerdrop": 0.0,
    "max_position_embeddings": 2048,
    "model_type": "opt",
    "num_attention_heads": 32,
    "num_hidden_layers": 24,
    "prefix": "</s>",
    "torch_dtype": "float16",
    "use_cache": true,
    "vocab_size": 50272,
    "word_embed_proj_dim": 2048
  },
  "torch_dtype": "float32",
  "transformers_version": "4.54.1",
  "use_decoder_only_language_model": true,
  "vision_config": {
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "hidden_act": "quick_gelu",
    "hidden_size": 1024,
    "image_size": 224,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "layer_norm_eps": 1e-05,
    "model_type": "blip_2_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "patch_size": 14,
    "projection_dim": 768,
    "qkv_bias": true
  }
}
