{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "blip2_vitl14_opt13b_slim",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q_proj",
    "query_key_value",
    "v_proj"
  ],
  "task_type": "SEQ_CLS",
  "use_dora": false,
  "use_rslora": false
}